#include <stdio.h>

int main() {
    float x, y;

    printf("Введіть координати точки A(x, y): ");
    scanf("%f %f", &x, &y);

    if (x > 0 && y > 0) {
        printf("Точка знаходиться в першому квадранті.\n");
    } else if (x < 0 && y > 0) {
        printf("Точка знаходиться в другому квадранті.\n");
    } else if (x < 0 && y < 0) {
        printf("Точка знаходиться в третьому квадранті.\n");
    } else if (x > 0 && y < 0) {
        printf("Точка знаходиться в четвертому квадранті.\n");
    } else if (x == 0 && y != 0) {
        printf("Точка знаходиться на осі Y.\n");
    } else if (x != 0 && y == 0) {
        printf("Точка знаходиться на осі X.\n");
    } else {
        printf("Точка знаходиться в початку координат.\n");
    }

    return 0;
}
